etc/loadtest/loadtest.yml
config:
  target: "https://zkmf2024-server.herokuapp.com/public"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 100
scenarios:
  - flow:
      - get:
          url: "/timetable"
      - get:
          url: "/location/wettspiel"
      - get:
          url: "/location/grosse-ref-kirche-schlieren"
      - get:
          url: "/verein/harmonie-am-bachtel"
      - get:
          url: "/sponsoring/random"
      - get:
          url: "/unterhaltung"
      - get:
          url: "/ranking"
      - get:
          url: "/timetable/preview/salmensaal-schlieren"